_posts/2022-07-01-bcc-bpftools-bpftrace.html
---
layout: post
title: "Notes: BCC, BPFtools, BPFTrace"
excerpt: "Notes related to perf"
---

<p>
This page contains various notes related to BCC, BPFTools, BPFTrace.
</p>

<div id="outline-container-org8fc511d" class="outline-2">
<h2 id="org8fc511d"><span class="section-number-2">1.</span> !!!This page requires cleaning!!!</h2>
</div>
<div id="outline-container-org978106d" class="outline-2">
<h2 id="org978106d"><span class="section-number-2">2.</span> Setting up Bpftrace</h2>
<div class="outline-text-2" id="text-2">
<p>
Setting up Bpftrace is a daunting task when working with a custom kernel. Bpftrace has a lot of dependencies on which they seem to have no control (in 2022 at least). If you want all functionalities, you especially have a problem&#x2026; Since this automatically contains some other tools, we need to install the other tools as well.
</p>

<p>
First make sure that you have all of your Linux headers installed&#x2026; On Ubuntu, the headers are generally in `/usr/src/include/linux-&lt;version&gt;/`, but your millage may very. Installing the headers if they miss can be done with:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">sudo</span> apt-get install linux-headers-$<span style="color: #51afef;">(</span>uname -r<span style="color: #51afef;">)</span>
</pre>
</div>
<p>
This might not work or even worse, install older headers!?? Yes the above command can in some cases install headers for older linux versions, which I do not understand. For my custom kernel setup, where I got the kernel from Canonical, I had to install the headers from there and then do (see /2022/06/26/upgrade-kernel-ubuntu.html):
</p>
<div class="org-src-container">
<pre class="src src-bash">dpkg -i &lt;headernames&gt;.deb
dpkg -i &lt;headernames&gt;-generic.deb
</pre>
</div>
<p>
However, if your kernel and your version of Ubuntu do not match, you might miss dependencies. In that case you need to build each of those dependencies or live dangerously and add newer Ubuntu versions to your /etc/apt/sources. For example, on Focal you do not have the most modern `libc6` and you do not have `libssl3`. Adding `Jimmy` or `imp` to your sources in this case can work (dangerous!)&#x2026;
</p>

<p>
Then first we want to have access to BPF tools. First check if they are already installed with bpftool &#x2013;version. If this does not work, it is time to build. This is analogous to how we install perf with the kernel source code. Navigate to the kernel source on your machine, but this time do:
</p>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">sudo</span> <span style="color: #ECBE7B;">make</span> -C tools/ bpf_install <span style="color: #dcaeea;">prefix</span>=/usr/
</pre>
</div>
<p>
This worked in my case. Again Linux warns if you miss dependencies. Check if all dependencies are green (libcap, &#x2026;) and not red.
</p>

<p>
Then install libbpf: <a href="https://github.com/libbpf/libbpf">https://github.com/libbpf/libbpf</a>. The install from this repo is confusing and installs to non-conventional paths. Instead follow part of the installation as done by Docker in bpftrace&#x2026; (<a href="https://github.com/iovisor/bpftrace/blob/master/docker/build.sh">https://github.com/iovisor/bpftrace/blob/master/docker/build.sh</a>) In general this should work:
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #ECBE7B;">git</span> checkout v0.5
<span style="color: #ECBE7B;">cd</span> src <span style="color: #5B6268;"># </span><span style="color: #5B6268;">No build directory?</span>
<span style="color: #dcaeea;">CC</span>=gcc <span style="color: #ECBE7B;">make</span> -j
<span style="color: #dcaeea;">PREFIX</span>=/usr/local/ <span style="color: #dcaeea;">LIBDIR</span>=/usr/local/lib <span style="color: #ECBE7B;">make</span> install install_uapi_headers
</pre>
</div>
<p>
Then install bcc, but FIRST install its dependencies. In general follow <a href="https://github.com/iovisor/bcc/blob/master/INSTALL.md">https://github.com/iovisor/bcc/blob/master/INSTALL.md</a> for Ubuntu. Do not apt install and do not follow installations from other distros. Further on, be sure to checkout to a stable version and not the head. In my case, v0.24.0 worked.
</p>

<p>
Only then can we start thinking about bpftrace&#x2026; Try to follow <a href="https://github.com/iovisor/bpftrace/blob/master/INSTALL.md">https://github.com/iovisor/bpftrace/blob/master/INSTALL.md</a>. When calling CMake there should only be &ldquo;yes&rdquo; and no &ldquo;no&rdquo; next to all BPF, BTF and kernel functions. If not, installations are set incorrectly. Install them and do rm CMakeCache.txt before reinstalling. Contrary to what we did for bcc, we now need the head as &ldquo;stable&rdquo; bpftrace breaks with &ldquo;stable&rdquo; libbpf and bcc. In my case commit: 766787a67f97fb4e9312ab38b9f4dc89001f0c51.
</p>

<p>
Then we can try bpftrace&#x2026; Try to run <a href="https://github.com/iovisor/bpftrace/issues/1832">https://github.com/iovisor/bpftrace/issues/1832</a>.
</p>
</div>
</div>
